validation/AMR/squareCylinder/LES/STD/3D/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

topoChanger
{
    type              multiFieldRefiner3D;

    libs              ("libfvMeshTopoChangers3D.so");

    // How often to refine
    refineInterval    512;

    // Fields to use for refinement
    refinementFields
    {
        normalizedVorticity
        {
            // Refine field in between lower..upper
            lowerRefineLevel    0.001;
            upperRefineLevel    1.0;
            operation           default;
        }

        normalizedLambda2
        {
            // Refine field in between lower..upper
            lowerRefineLevel    0.0;
            upperRefineLevel    1.0;
            operation           OR;
        }

        normalizedFilter
        {
            // Refine field in between lower..upper
            lowerRefineLevel    5.0;
            upperRefineLevel    1e10;
            operation           OR;
        }

        object
        {
            // Refine based on geometry constraint
            type                geometry;
            surface             "object.stl";
            mode                inside;
            buffer              0.016;
            operation           AND;
        }
    }

    // Have slower than 2:1 refinement
    nBufferLayers     1;

    // Refine cells only up to maxRefinement levels
    maxRefinement     2;

    // Stop refinement if maxCells reached
    maxCells          3000000;

    // Flux field and corresponding velocity field. Fluxes on changed
    // faces get recalculated by interpolating the velocity. Use 'none'
    // on surfaceScalarFields that do not need to be reinterpolated.
    correctFluxes
    (
        (phi none)
        (nHatf none)
        (rhoPhi none)
        (meshPhi none)
        (meshPhi_0 none)
        (ghf none)
    );

    // Write the refinement level as a volScalarField
    dumpLevel       	true;
}

// ************************************************************************* //
